## A country is big if it has an area of bigger than 3 million square km or a population of more than 25 million.

Write a SQL solution to output big countries' name, population and area.

In [1]:
%load_ext sql
%sql sqlite://

In [2]:
%%sql
Create Table World 
(
    Name        varchar(6),
    Continent   varchar(6),
    Area        integer,
    Population  integer,
    GDP         integer
    
);

INSERT INTO World
VALUES ('Afghanistan','Asia',652230,25500100,20343000),
        ('Albania','Europe',28748,2831741,12960000),
        ('Algeria','Africa',2381741,37100000,188681000),
        ('Andorra','Europe',468,78115,3712000),
        ('Angola','Africa',1246700,20609294,100990000);

 * sqlite://
Done.
5 rows affected.

[]

In [3]:
%%sql
SELECT * FROM World #show the original table.

 * sqlite://
Done.

[('Afghanistan', 'Asia', 652230, 25500100, 20343000),
 ('Albania', 'Europe', 28748, 2831741, 12960000),
 ('Algeria', 'Africa', 2381741, 37100000, 188681000),
 ('Andorra', 'Europe', 468, 78115, 3712000),
 ('Angola', 'Africa', 1246700, 20609294, 100990000)]

In [4]:
%%sql
SELECT Name, Population, Area #columns to return
FROM World #table
WHERE World.Population > 25000000 or World.Area > 3000000 #basic condition

 * sqlite://
Done.

[('Afghanistan', 25500100, 652230), ('Algeria', 37100000, 2381741)]